package by.it.valuevich.lesson02;

import java.util.Scanner;

import static java.lang.Integer.*;

/* Нужно написать программу, которая вводит два числа с клавиатуры
и 4 раза выводит их сумму с обозначением системы счисления на экран в
ДЕСЯТИЧНОМ ДВОИЧНОМ ШЕСТНАДЦАТИРИЧНОМ ВОСЬМИРИЧНОМ виде

Вот пример ввода с клавиатуры:
34 26

Тогда вывод ожидается такой (обратите внимание на регистр букв):
DEC:34+26=60
BIN:100010+11010=111100
HEX:22+1a=3c
OCT:42+32=74
*/
//class TaskC2 {
//    public static void main(String[] args) {
//        Scanner sc = new Scanner(System.in);
//        int i = sc.nextInt();
//        int j = sc.nextInt();
//        int sum = i + j;
//        System.out.println("DEC:" + i + "+" + j + "=" + sum);
//
//        String binary = toBinaryString(i, j, sum);
//        System.out.println("BIN:" + i + "+" + j + "=" + sum);
//
//        String octal = toOctalString(i, j, sum);
//        System.out.println("HEX:" + i + "+" + j + "=" + sum);
//
//        String hex = toHexString(i, j, sum);
//        System.out.println("OCT:" + i + "+" + j + "=" + sum);
//
//    }
//
//    private static String toOctalString(int i, int j, int sum) {
//    }

//    private static String toBinaryString(int i, int j, int sum) {
//    }
//
//    private static String toHexString(int i, int j, int sum) {
//    }
//
//
//}
