package by.it.valuevich.lesson04;

/*
Вывести таблицу умножения 10 x 10 (двоныйм циклом),
но вывод должен быть словами:

Ожидаемый вывод:
два умножить на два равно четыре
два умножить на три равно шесть
два умножить на четыре равно восемь
два умножить на пять равно десять
два умножить на шесть равно двенадцать
два умножить на семь равно четырнадцать
два умножить на восемь равно шестнадцать
два умножить на девять равно восемнадцать
два умножить на десять равно двадцать
три умножить на два равно шесть
три умножить на три равно девять
три умножить на четыре равно двенадцать
...
и т.д. до фразы
...
десять умножить на десять равно сто
*/

public class TaskC3 {
    static String cypherToString(int cypher) {

        String[][] w = {
                {"", "один ", "два ", "три ", "четыре ", "пять ", "шесть ", "семь ", "восемь ", "девять ",
                        "десять ", "одиннадцать ", "двенадцать ", "тринадцать ", "четырнадцать ", "пятнадцать ",
                        "шестнадцать ", "семнадцать ", "восемнадцать ", "девятнадцать ", ""},

                {"", "", "двадцать ", "тридцать ", "сорок ", "пятьдесят ", "шестьдесят ", "семьдесят ", "восемьдесят ", "девяносто "},
                {"", "сто ", "двести ", "триста ", "четырста ", "пятьсот ", "шестьсот ", "семьсот ", "восемьсот ", "девятьсот "}
        };
        int i2 = cypher / 100;
        cypher = cypher - i2 * 100;
        int i1 = cypher / 10;
        cypher = cypher - i1 * 10;
        int i0 = i1 < 2 ? cypher + i1 * 10 : cypher;
        return w[2][i2] + w[1][i1] + w[0][i0];
    }


    public static void main(String[] args) {
        for (int i = 2; i <= 10; i++) {
            for (int j = 2; j <= 10; j++) {

//                        System.out.println("testing = testing.include(\""+cypherToString(i) + "умножить на " + cypherToString(j) + "равно " + cypherToString(i * j)+"\");");
                System.out.println(cypherToString(i) + "умножить на " + cypherToString(j) + "равно " + cypherToString(i * j));
            }
        }
    }



}
